In [55]:
import pandas as pd

In [56]:
two_dimensional_list = [['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]]

In [57]:
my_df = pd.DataFrame(two_dimensional_list, columns=['name', 'sex', 'age'], index=['a', 'b', 'c', 'd', 'e', 'f'])
my_df

    name sex  age
a  frank   M   29
b   mary   F   23
c    tom   M   35
d    ted   M   33
e   jean   F   21
f   lisa   F   20

In [58]:
type(my_df)

pandas.core.frame.DataFrame

In [59]:
my_df.columns

Index(['name', 'sex', 'age'], dtype='object')

In [60]:
my_df.index

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [61]:
my_df.dtypes

name    object
sex     object
age      int64
dtype: object

In [62]:
import pandas as pd

list = [['Taylor Swift', 'December 13, 1989', 'Singer-songwriter'],
        ['Aaron Sorkin', 'June 9, 1961', 'Screenwriter'],
        ['Harry Potter', 'July 31, 1980', 'Wizard'],
        ['Ji-Sung Park', 'February 25, 1981', 'Footballer']]

df = pd.DataFrame(list, columns=['name','birthday','occupation'])
df

           name           birthday         occupation
0  Taylor Swift  December 13, 1989  Singer-songwriter
1  Aaron Sorkin       June 9, 1961       Screenwriter
2  Harry Potter      July 31, 1980             Wizard
3  Ji-Sung Park  February 25, 1981         Footballer

In [63]:
iphone_df = pd.read_csv('data/iphone.csv', index_col=0)
iphone_df

                      출시일  디스플레이  메모리     출시 버전 Face ID
iPhone 7       2016-09-16    4.7  2GB  iOS 10.0      No
iPhone 7 Plus  2016-09-16    5.5  3GB  iOS 10.0      No
iPhone 8       2017-09-22    4.7  2GB  iOS 11.0      No
iPhone 8 Plus  2017-09-22    5.5  3GB  iOS 11.0      No
iPhone X       2017-11-03    5.8  3GB  iOS 11.1     Yes
iPhone XS      2018-09-21    5.8  4GB  iOS 12.0     Yes
iPhone XS Max  2018-09-21    6.5  4GB  iOS 12.0     Yes

In [64]:
type(iphone_df)

pandas.core.frame.DataFrame

In [65]:
import pandas as pd

names = pd.read_csv('data/popular_baby_names.csv')
df = pd.DataFrame(names)
df

,Year of Birth,Gender,Ethnicity,Child's First Name,Count,Rank
0,2016,FEMALE,ASIAN AND PACIFIC ISLANDER,Olivia,172,1
1,2016,FEMALE,ASIAN AND PACIFIC ISLANDER,Chloe,112,2
2,2016,FEMALE,ASIAN AND PACIFIC ISLANDER,Sophia,104,3
3,2016,FEMALE,ASIAN AND PACIFIC ISLANDER,Emily,99,4
4,2016,FEMALE,ASIAN AND PACIFIC ISLANDER,Emma,99,4
...,...,...,...,...,...,...
11340,2011,MALE,WHITE NON HISPANIC,LEV,10,97
11341,2011,MALE,WHITE NON HISPANIC,AUGUSTUS,10,97
11342,2011,MALE,WHITE NON HISPANIC,SHAUL,10,97
11343,2011,MALE,WHITE NON HISPANIC,WESLEY,10,97
11344,2011,MALE,WHITE NON HISPANIC,KENNETH,10,97

In [66]:
import pandas as pd

# 여기에 코드를 작성하세요
data = pd.read_csv('data/mega_millions.csv', index_col=0)
df = pd.DataFrame(data)
# 테스트 코드
df

           Winning Numbers  Mega Ball  Multiplier
Draw Date
02/15/2019  10 38 40 43 65         12         2.0
02/12/2019  15 32 39 50 65          7         3.0
02/08/2019  14 24 31 42 48         13         3.0
02/05/2019  03 34 36 59 66          7         2.0
02/01/2019  02 37 48 66 68         11         5.0
...                    ...        ...         ...
05/31/2002  12 28 45 46 52         47         NaN
05/28/2002  06 21 22 29 32         24         NaN
05/24/2002  02 04 32 44 52         36         NaN
05/21/2002  04 28 39 41 44          9         NaN
05/17/2002  15 18 25 33 47         30         NaN

[1746 rows x 3 columns]